#+TITLE: title
#+AUTHOR: 刘敏
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil
#+EMAIL: leomin@gmail.com
*** 读入csv数据
#+BEGIN_SRC ipython :session :exports both :tangle yes
train_df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')
train_df.head()
#+END_SRC

#+RESULTS:
#+begin_example
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
#+end_example

*** 看看数据大概的信息
#+BEGIN_SRC ipython :session :results output :exports both :tangle yes
train_df.info()
print '-'*80
test_df.info()
#+END_SRC

#+RESULTS:
#+begin_example
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
--------------------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
#+end_example

从上面数据信息可以得到如下初步结论：
1. 有些字段有数据缺失：Age Cabin Fare Embarked
2. 有些字段是String类型，不是数字类型，后面需要转换
3. 有些字段需要用one-hot encoding
**** 将Embark这种category特征转化为数字特征(one-hot encoding)
[2016-10-08 Sat 16:37]
#+BEGIN_SRC ipython :session  :exports both :tangle yes :results output
embark_dummies_train = pd.get_dummies(train_df['Embarked'])
print embark_dummies_train
# drop S in Embarked dummies
embark_dummies_train.drop(['S'], axis=1, inplace=True)
embark_dummies_test = pd.get_dummies(test_df['Embarked'])
embark_dummies_test.drop(['S'], axis=1, inplace=True)
train_df = train_df.join(embark_dummies_train)
test_df = test_df.join(embark_dummies_test)
train_df.drop(['Embarked'], axis=1, inplace=True)
test_df.drop(['Embarked'], axis=1, inplace=True)
#+END_SRC

#+RESULTS:
#+begin_example
       C    Q    S
0    0.0  0.0  1.0
1    1.0  0.0  0.0
2    0.0  0.0  1.0
3    0.0  0.0  1.0
4    0.0  0.0  1.0
5    0.0  1.0  0.0
6    0.0  0.0  1.0
7    0.0  0.0  1.0
8    0.0  0.0  1.0
9    1.0  0.0  0.0
10   0.0  0.0  1.0
11   0.0  0.0  1.0
12   0.0  0.0  1.0
13   0.0  0.0  1.0
14   0.0  0.0  1.0
15   0.0  0.0  1.0
16   0.0  1.0  0.0
17   0.0  0.0  1.0
18   0.0  0.0  1.0
19   1.0  0.0  0.0
20   0.0  0.0  1.0
21   0.0  0.0  1.0
22   0.0  1.0  0.0
23   0.0  0.0  1.0
24   0.0  0.0  1.0
25   0.0  0.0  1.0
26   1.0  0.0  0.0
27   0.0  0.0  1.0
28   0.0  1.0  0.0
29   0.0  0.0  1.0
..   ...  ...  ...
861  0.0  0.0  1.0
862  0.0  0.0  1.0
863  0.0  0.0  1.0
864  0.0  0.0  1.0
865  0.0  0.0  1.0
866  1.0  0.0  0.0
867  0.0  0.0  1.0
868  0.0  0.0  1.0
869  0.0  0.0  1.0
870  0.0  0.0  1.0
871  0.0  0.0  1.0
872  0.0  0.0  1.0
873  0.0  0.0  1.0
874  1.0  0.0  0.0
875  1.0  0.0  0.0
876  0.0  0.0  1.0
877  0.0  0.0  1.0
878  0.0  0.0  1.0
879  1.0  0.0  0.0
880  0.0  0.0  1.0
881  0.0  0.0  1.0
882  0.0  0.0  1.0
883  0.0  0.0  1.0
884  0.0  0.0  1.0
885  0.0  1.0  0.0
886  0.0  0.0  1.0
887  0.0  0.0  1.0
888  0.0  0.0  1.0
889  1.0  0.0  0.0
890  0.0  1.0  0.0

[891 rows x 3 columns]
#+end_example
**** Final Feature
#+BEGIN_SRC ipython :session  :exports both :tangle yes :results output
train_df.info()
#+END_SRC

#+RESULTS:
#+begin_example
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Survived    891 non-null int64
Age         891 non-null int64
Fare        891 non-null int64
C           891 non-null float64
Q           891 non-null float64
Family      891 non-null int64
Child       891 non-null float64
Female      891 non-null float64
Class_1     891 non-null float64
Class_2     891 non-null float64
dtypes: float64(6), int64(4)
memory usage: 69.7 KB
#+end_example
